app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT `carts`.* FROM `carts`

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2014-08-06 16:13:41', '2014-08-06 16:13:41')

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1