app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items`
---
  def index
    @line_items = LineItem.all

DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962
---
  def destroy
    @line_item.destroy

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
    def set_line_item
      @line_item = LineItem.find(params[:id])