app/controllers/line_items_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 ORDER BY `products`.`id` ASC LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2014-08-06 07:13:21', '2014-08-06 07:13:21')
INSERT INTO `line_items` (`cart_id`, `created_at`, `product_id`, `updated_at`) VALUES (1, '2014-08-06 07:13:21', 1, '2014-08-06 07:13:21')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2014-08-06 12:06:35' WHERE `line_items`.`id` = 1
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save