app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `image_url`, `title`, `updated_at`) VALUES ('2014-07-26 15:18:46', '', '', '', '2014-07-26 15:18:46')

  def who_bought
    @product = Product.find(params[:id])
    @latest_order = @product.orders.order(:updated_at).last
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
SELECT `orders`.* FROM `orders` INNER JOIN `line_items` ON `orders`.`id` = `line_items`.`order_id` WHERE `line_items`.`product_id` = 3 ORDER BY `orders`.`updated_at` DESC LIMIT 1