app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2014-08-06 16:13:42', 'Wibbles are fun!', 'lorem.jpg', 19.95, 'Lorem Ipsam', '2014-08-06 16:13:42')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `title` = 'Lorem Ipsam', `description` = 'Wibbles are fun!', `image_url` = 'lorem.jpg', `price` = 19.95, `updated_at` = '2014-08-06 16:13:42' WHERE `products`.`id` = 980190962

  def destroy
    @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 980190962

    def set_product
      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1