app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY `users`.`name` ASC
---
  def index
    @users = User.order(:name)

INSERT INTO `users` (`created_at`, `name`, `password_digest`, `updated_at`) VALUES ('2014-08-14 13:09:09', 'mitesh', '$2a$10$3OeCeEmuZ/FR.EKKQoTWGuFGKxdSPbofjWC.IPMoirSxElEM62W6C', '2014-08-14 13:09:09')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    begin
    @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])